# parameters
nc: 4  # number of classes
depth_multiple: 1.0  # models depth multiple
width_multiple: 1.0  # layer channel multiple

#anchors
anchors:
  - [22,15,  21,40,  53,42,  40,71]  # P2/4
  - [77,72,  55,113,  124,87,  90,130]  # P3/8
  - [139,141,  110,202,  235,129,  160,233]  # P4/16
  - [247,219,  362,191,  205,359,  368,278]  # P5/32

# csp-p5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, BottleneckCSP, [64]],
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4
   [-1, 3, BottleneckCSP, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 5-P3/8
   [-1, 13, BottleneckCSP, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16
   [-1, 13, BottleneckCSP, [512]],
   [-1, 1, Conv, [1024, 3, 2]], # 9-P5/32
   [-1, 6, BottleneckCSP, [1024]],  # 10
  ]

# yolov4-p5 head
head:
  [[-1, 1, SPPCSP, [512]], # 11

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [8, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   [-1, 2, BottleneckCSP2, [256]], # 16

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [6, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   [-1, 2, BottleneckCSP2, [128]], # 21

   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [4, 1, Conv, [64, 1, 1]], # route backbone P2
   [[-1, -2], 1, Concat, [1]],
   [-1, 2, BottleneckCSP2, [64]], # 26

   [-1, 1, Conv, [128, 3, 1]],
   [-2, 1, Conv, [128, 3, 2]],
   [[-1, 21], 1, Concat, [1]],  # cat
   [-1, 2, BottleneckCSP2, [128]], # 30

   [-1, 1, Conv, [256, 3, 1]],
   [-2, 1, Conv, [256, 3, 2]],
   [[-1, 16], 1, Concat, [1]],  # cat
   [-1, 2, BottleneckCSP2, [256]], # 34

   [-1, 1, Conv, [512, 3, 1]],
   [-2, 1, Conv, [512, 3, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat
   [-1, 2, BottleneckCSP2, [512]], # 38

   [-1, 1, Conv, [1024, 3, 1]],
   [[27, 31, 35, 39], 1, Detect, [nc, anchors]],   # Detect(P2, P3, P4, P5)
  ]