# parameters
nc: 3  # number of classes
depth_multiple: 1.0  # models depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
#anchors:
#  - [13,17,  31,25,  24,51] # P2/4
#  - [61,45,  48,102,  119,96]  # P3/8
#  - [97,189, 217,184, 171,384,]  # P4/16
#  - [324,451, 616,618, 800,800]  # P5/32
anchors:
  - [13,17,  31,25,  24,51, 61,45]  # P2/8
  - [61,45,  48,102,  119,96, 97,189]  # P3/16
  - [97,189,  217,184,  171,384, 324,451]  # P4/32
  - [324,451, 545,357, 616,618, 1024,1024]  # P5/64

# csp-p5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, BottleneckCSP, [64]],
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4
   [-1, 3, BottleneckCSP, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 5-P3/8
   [-1, 15, BottleneckCSP, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16
   [-1, 15, BottleneckCSP, [512]],
   [-1, 1, Conv, [1024, 3, 2]], # 9-P5/32
   [-1, 7, BottleneckCSP, [1024]],  # 10
  ]

# yolov4-p5 head
# na = len(anchors[0])
head:
  [[-1, 1, SPPCSP, [512]], # 11
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [8, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   [-1, 3, BottleneckCSP2, [256]], # 16
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [6, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   [-1, 3, BottleneckCSP2, [128]], # 21
   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [4, 1, Conv, [64, 1, 1]], # route backbone P2
   [[-1, -2], 1, Concat, [1]],
   [-1, 3, BottleneckCSP2, [64]], # 26
   [-1, 1, Conv, [128, 3, 1]],
   [-2, 1, Conv, [128, 3, 2]],
   [[-1, 21], 1, Concat, [1]],  # cat
   [-1, 3, BottleneckCSP2, [128]], # 30
   [-1, 1, Conv, [256, 3, 1]],
   [-2, 1, Conv, [256, 3, 2]],
   [[-1, 16], 1, Concat, [1]],  # cat
   [-1, 3, BottleneckCSP2, [256]], # 34
   [-1, 1, Conv, [512, 3, 1]],
   [-2, 1, Conv, [512, 3, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat
   [-1, 3, BottleneckCSP2, [512]], # 38
   [-1, 1, Conv, [1024, 3, 1]],
   [[27, 31, 35, 39], 1, Detect, [nc, anchors]],   # Detect(P2, P3, P4, P5)
  ]